---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.NElementsDeleted
source: html/60571d30-6634-1fb9-0c36-8bf20aad55c4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.NElementsDeleted Property

[Number] elements were deleted

## Syntax (C#)
```csharp
public static FailureDefinitionId NElementsDeleted { get; }
```